import Book from "./Book";

const data = [
  {
    name: "পাপ করব না আর",
    imgUrl: "https://ikhlasstore.com/wp-content/uploads/2022/10/1-3-scaled.jpg",
    price: 320,
    discountPrice: 240,
    author: "মুফতি মুহাম্মদ শুয়াইবুল্লাহ খান",
    category: "আত্মশুদ্ধি ও অনুপ্রেরণা",
    description:
      "একবার নবীজির চাচাতো ভাই আব্দুল্লাহ ইবনু আব্বাস (রাযি.)-কে এক ব্যক্তি জিজ্ঞেস করল, ‘ধরুন কেউ কম পাপ করে, আবার নেকিও করে কম। আরেক ব্যক্তি পাপ করে বেশি, আবার নেকিও বেশি করে—এদের দুজনের মধ্যে কে বেশি উত্তম? ইবনু আব্বাস প্রশ্ন শুনে বললেন, ‘আমি কোনো কিছুকে (পাপ থেকে) বেঁচে থাকার মতো উত্তম মনে করি না’ অর্থাৎ পাপ থেকে বেঁচে থাকা এমন আমল, যার বরাবর অন্য কোনো আমল হতে পারে না। এজন্য পূর্বসুরিগণ এর গুরুত্ব বোঝাতে গিয়ে বলতেন, ‘দিনের বেলা আল্লাহকে (শতভাগ ভাগ) ভয় করো এবং পুরো রাত (তাহাজ্জুদ না পড়ে) ঘুমিয়ে থাকো (সমস্যা নেই)।’পাপ থেকে বেঁচে থাকার অনুপ্রেরণা নিয়ে মুফতি মুহাম্মদ শুয়াইবুল্লাহ খানের দরদ মাখা অনবদ্য কাজ—’পাপ করব না আর’। পাপ থেকে বেঁচে থাকার সকল পন্থা এখানে লেখক আলোচনা করেছেন। উন্মাদ হয়ে গুনাহের সামুদ্রে হাবুডুবু খাওয়া উম্মতের জন্য একটি উপকারী বই।",
  },
  {
    name: "আল আসমাউল হুসনা",
    imgUrl:
      "https://ikhlasstore.com/wp-content/uploads/2022/09/1-10-scaled.jpg",
    price: 360,
    discountPrice: 270,
    author: "উস্তাদ নোমান আলী খান",
    category: "আত্মশুদ্ধি ও অনুপ্রেরণা",
    description:
      "একবার নবীজির চাচাতো ভাই আব্দুল্লাহ ইবনু আব্বাস (রাযি.)-কে এক ব্যক্তি জিজ্ঞেস করল, ‘ধরুন কেউ কম পাপ করে, আবার নেকিও করে কম। আরেক ব্যক্তি পাপ করে বেশি, আবার নেকিও বেশি করে—এদের দুজনের মধ্যে কে বেশি উত্তম? ইবনু আব্বাস প্রশ্ন শুনে বললেন, ‘আমি কোনো কিছুকে (পাপ থেকে) বেঁচে থাকার মতো উত্তম মনে করি না’ অর্থাৎ পাপ থেকে বেঁচে থাকা এমন আমল, যার বরাবর অন্য কোনো আমল হতে পারে না। এজন্য পূর্বসুরিগণ এর গুরুত্ব বোঝাতে গিয়ে বলতেন, ‘দিনের বেলা আল্লাহকে (শতভাগ ভাগ) ভয় করো এবং পুরো রাত (তাহাজ্জুদ না পড়ে) ঘুমিয়ে থাকো (সমস্যা নেই)।’পাপ থেকে বেঁচে থাকার অনুপ্রেরণা নিয়ে মুফতি মুহাম্মদ শুয়াইবুল্লাহ খানের দরদ মাখা অনবদ্য কাজ—’পাপ করব না আর’। পাপ থেকে বেঁচে থাকার সকল পন্থা এখানে লেখক আলোচনা করেছেন। উন্মাদ হয়ে গুনাহের সামুদ্রে হাবুডুবু খাওয়া উম্মতের জন্য একটি উপকারী বই।",
  },
  {
    name: "এক-এর আহ্বান",
    imgUrl: "https://ikhlasstore.com/wp-content/uploads/2022/10/12-scaled.jpg",
    price: 190,
    discountPrice: 0,
    author: "মুহাম্মাদ মুশফিকুর রহমান মিনার",
    category: "ঈমান আক্বিদা-মানহাজ",
    description:
      "একবার নবীজির চাচাতো ভাই আব্দুল্লাহ ইবনু আব্বাস (রাযি.)-কে এক ব্যক্তি জিজ্ঞেস করল, ‘ধরুন কেউ কম পাপ করে, আবার নেকিও করে কম। আরেক ব্যক্তি পাপ করে বেশি, আবার নেকিও বেশি করে—এদের দুজনের মধ্যে কে বেশি উত্তম? ইবনু আব্বাস প্রশ্ন শুনে বললেন, ‘আমি কোনো কিছুকে (পাপ থেকে) বেঁচে থাকার মতো উত্তম মনে করি না’ অর্থাৎ পাপ থেকে বেঁচে থাকা এমন আমল, যার বরাবর অন্য কোনো আমল হতে পারে না। এজন্য পূর্বসুরিগণ এর গুরুত্ব বোঝাতে গিয়ে বলতেন, ‘দিনের বেলা আল্লাহকে (শতভাগ ভাগ) ভয় করো এবং পুরো রাত (তাহাজ্জুদ না পড়ে) ঘুমিয়ে থাকো (সমস্যা নেই)।’পাপ থেকে বেঁচে থাকার অনুপ্রেরণা নিয়ে মুফতি মুহাম্মদ শুয়াইবুল্লাহ খানের দরদ মাখা অনবদ্য কাজ—’পাপ করব না আর’। পাপ থেকে বেঁচে থাকার সকল পন্থা এখানে লেখক আলোচনা করেছেন। উন্মাদ হয়ে গুনাহের সামুদ্রে হাবুডুবু খাওয়া উম্মতের জন্য একটি উপকারী বই।",
  },
  {
    name: "আল আসমাউল হুসনা",
    imgUrl: "https://ikhlasstore.com/wp-content/uploads/2022/10/1-3-scaled.jpg",
    price: 360,
    discountPrice: 270,
    author: "আহমদ তাম্মাম",
    category: "ঈমান আক্বিদা-মানহাজ",
    description:
      "একবার নবীজির চাচাতো ভাই আব্দুল্লাহ ইবনু আব্বাস (রাযি.)-কে এক ব্যক্তি জিজ্ঞেস করল, ‘ধরুন কেউ কম পাপ করে, আবার নেকিও করে কম। আরেক ব্যক্তি পাপ করে বেশি, আবার নেকিও বেশি করে—এদের দুজনের মধ্যে কে বেশি উত্তম? ইবনু আব্বাস প্রশ্ন শুনে বললেন, ‘আমি কোনো কিছুকে (পাপ থেকে) বেঁচে থাকার মতো উত্তম মনে করি না’ অর্থাৎ পাপ থেকে বেঁচে থাকা এমন আমল, যার বরাবর অন্য কোনো আমল হতে পারে না। এজন্য পূর্বসুরিগণ এর গুরুত্ব বোঝাতে গিয়ে বলতেন, ‘দিনের বেলা আল্লাহকে (শতভাগ ভাগ) ভয় করো এবং পুরো রাত (তাহাজ্জুদ না পড়ে) ঘুমিয়ে থাকো (সমস্যা নেই)।’পাপ থেকে বেঁচে থাকার অনুপ্রেরণা নিয়ে মুফতি মুহাম্মদ শুয়াইবুল্লাহ খানের দরদ মাখা অনবদ্য কাজ—’পাপ করব না আর’। পাপ থেকে বেঁচে থাকার সকল পন্থা এখানে লেখক আলোচনা করেছেন। উন্মাদ হয়ে গুনাহের সামুদ্রে হাবুডুবু খাওয়া উম্মতের জন্য একটি উপকারী বই।",
  },
  {
    name: "জান্নাতের সুসংবাদ প্রাপ্ত ৬০ সাহাবী",
    imgUrl: "https://ikhlasstore.com/wp-content/uploads/2022/10/1-2-scaled.jpg",
    price: 360,
    discountPrice: 270,
    author: "আবূ রুমাইসা",
    category: "সাহাবীদের জীবনী",
    description:
      "একবার নবীজির চাচাতো ভাই আব্দুল্লাহ ইবনু আব্বাস (রাযি.)-কে এক ব্যক্তি জিজ্ঞেস করল, ‘ধরুন কেউ কম পাপ করে, আবার নেকিও করে কম। আরেক ব্যক্তি পাপ করে বেশি, আবার নেকিও বেশি করে—এদের দুজনের মধ্যে কে বেশি উত্তম? ইবনু আব্বাস প্রশ্ন শুনে বললেন, ‘আমি কোনো কিছুকে (পাপ থেকে) বেঁচে থাকার মতো উত্তম মনে করি না’ অর্থাৎ পাপ থেকে বেঁচে থাকা এমন আমল, যার বরাবর অন্য কোনো আমল হতে পারে না। এজন্য পূর্বসুরিগণ এর গুরুত্ব বোঝাতে গিয়ে বলতেন, ‘দিনের বেলা আল্লাহকে (শতভাগ ভাগ) ভয় করো এবং পুরো রাত (তাহাজ্জুদ না পড়ে) ঘুমিয়ে থাকো (সমস্যা নেই)।’পাপ থেকে বেঁচে থাকার অনুপ্রেরণা নিয়ে মুফতি মুহাম্মদ শুয়াইবুল্লাহ খানের দরদ মাখা অনবদ্য কাজ—’পাপ করব না আর’। পাপ থেকে বেঁচে থাকার সকল পন্থা এখানে লেখক আলোচনা করেছেন। উন্মাদ হয়ে গুনাহের সামুদ্রে হাবুডুবু খাওয়া উম্মতের জন্য একটি উপকারী বই।",
  },
  {
    name: "বিয়ে ও রিযিক",
    imgUrl: "https://ikhlasstore.com/wp-content/uploads/2022/10/1-5-scaled.jpg",
    price: 360,
    discountPrice: 270,
    author: "মাওলানা আবু দারদা ইরাকি",
    category: "পরিবার ও সামাজিক জীবন",
    description:
      "একবার নবীজির চাচাতো ভাই আব্দুল্লাহ ইবনু আব্বাস (রাযি.)-কে এক ব্যক্তি জিজ্ঞেস করল, ‘ধরুন কেউ কম পাপ করে, আবার নেকিও করে কম। আরেক ব্যক্তি পাপ করে বেশি, আবার নেকিও বেশি করে—এদের দুজনের মধ্যে কে বেশি উত্তম? ইবনু আব্বাস প্রশ্ন শুনে বললেন, ‘আমি কোনো কিছুকে (পাপ থেকে) বেঁচে থাকার মতো উত্তম মনে করি না’ অর্থাৎ পাপ থেকে বেঁচে থাকা এমন আমল, যার বরাবর অন্য কোনো আমল হতে পারে না। এজন্য পূর্বসুরিগণ এর গুরুত্ব বোঝাতে গিয়ে বলতেন, ‘দিনের বেলা আল্লাহকে (শতভাগ ভাগ) ভয় করো এবং পুরো রাত (তাহাজ্জুদ না পড়ে) ঘুমিয়ে থাকো (সমস্যা নেই)।’পাপ থেকে বেঁচে থাকার অনুপ্রেরণা নিয়ে মুফতি মুহাম্মদ শুয়াইবুল্লাহ খানের দরদ মাখা অনবদ্য কাজ—’পাপ করব না আর’। পাপ থেকে বেঁচে থাকার সকল পন্থা এখানে লেখক আলোচনা করেছেন। উন্মাদ হয়ে গুনাহের সামুদ্রে হাবুডুবু খাওয়া উম্মতের জন্য একটি উপকারী বই।",
  },
];

const Booksec = ({ title }) => {
  return (
    <div className="flex flex-col">
      {title ? (
        <h2 className="text-2xl font-bold leading-10 pl-4 py-2">{title}</h2>
      ) : null}
      <div className="BOOKSEC px-4">
        {data?.map((book, i) => (
          <Book data={book} key={i} />
        ))}
      </div>
    </div>
  );
};

export default Booksec;
